app/controllers/admin/branches_controller.rb

  def index
    @branches = Branch.all
---
SELECT `branches`.* FROM `branches`

  def show
    @owner = @branch.user if @branch.user.present?
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1

  def create
  	@branch = Branch.new(branch_params)
  	if @branch.save
---
INSERT INTO `branches` (`school_id`, `cover_file_name`, `cover_content_type`, `cover_file_size`, `cover_updated_at`, `branch_name`, `city`, `address`, `status`, `created_at`, `updated_at`) VALUES (3, 'KIPS_Logo.jpg', 'image/jpeg', 570274, '2018-05-05 15:26:12', 'Johar Town ', 'Lahore', 'Johar Town near Allahu chowk', 1, '2018-05-05 15:26:13', '2018-05-05 15:26:13')

  def update
  	if @branch.update(branch_params)
---
UPDATE `branches` SET `school_id` = 2, `status` = 1, `updated_at` = '2018-05-05 17:02:16' WHERE `branches`.`id` = 1

  def destroy
  	if @branch.destroy
---
DELETE FROM `branches` WHERE `branches`.`id` = 1

  def find_branch
  	@branch = Branch.find_by(id: params[:id])
---
SELECT  `branches`.* FROM `branches` WHERE `branches`.`id` = 2 LIMIT 1