app/controllers/admin/dashboards_controller.rb

SELECT COUNT(*) FROM `schools`
SELECT COUNT(*) FROM `branches`
---
  def index
  	@schools = School.count
  	@branches = Branch.count