app/controllers/admin/schools_controller.rb

SELECT `schools`.* FROM `schools`
---
  def index
    @schools = School.all

INSERT INTO `schools` (`name`, `status`, `created_at`, `updated_at`) VALUES ('Kips', 1, '2018-05-05 08:00:48', '2018-05-05 08:00:48')
---
  def create
  	@school = School.new(school_params)
  	if @school.save

UPDATE `schools` SET `status` = 1, `updated_at` = '2018-05-05 17:02:00' WHERE `schools`.`id` = 2
UPDATE `branches` SET `branches`.`status` = 1 WHERE `branches`.`school_id` = 3
---
  def update
  	if @school.update(school_params)
      @school.branches.update_all(status: @school.status)

DELETE FROM `schools` WHERE `schools`.`id` = 1
---
  def destroy
  	if @school.destroy

SELECT  `schools`.* FROM `schools` WHERE `schools`.`id` = 2 LIMIT 1
---
  def find_school
  	@school = School.find_by(id: params[:id])