app/views/admin/dashboards/index.html.erb

                                  <p>Classes</p>
                                  <%= current_user.branch.branch_classes.count %>
---
SELECT COUNT(*) FROM `branches`